	
	let TrollBot = require('./classes/TrollBot');		
	new TrollBot( 
					[//Good Guys
						'TIM'
						,'Al Gl'
						,'Николай Горбунов'
						,'Артем Артем'
						,'Нормальный Ватник'
						,'Ya Bo'
						,'Алексей Брёхов'
						,'sergo'
						,'Ильдар'
					], 
					[// Bad Guys
					  ,'Александр Машенков'
					  ,"Кекс"
					  ,"Дмитрий З"
					  ,"Хотабыч"
					  ,"женяя женя"
					  ,"Alex Pupkin"						
					], 
					[//insults
						"казёл",
						"дурак",						
						"чмо",  
						"дятел", 
						"иплан",
						"баран",
						"кретин",
						"глист",
						"дуболом",
						"сказочный дeбил",
						"петух гамбургский",
						"пидр ливанский",
						"чмо болотное",
						"козёл тимур",
						"баобаб",						
						"тупень", 
						"обдристанный хомяк",
						"ниже плинтуса",
					], 
					[//praises
						 "Так Дер-ржать!!"
						,"Точно!"
						,"Так оно и есть!"
						,"Прр-равильно Говор-ришь!!"
						,"Прр-равильно !!"
						,"Ррр-разумно !!"
						,"Рр-рационально!!"
						,"Гр-рамотно!!"
					],
					[//actions
						 '\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Ищет блох у Шелеста в голове...>'
						,'\n\n<...Выдергивает перышко из подмышки...>'
						,'\n\n<...Какает Шелесту на пиджак...>'
						,'\n\n<...Какает Шелесту на пиджак...>'
						,'\n\n<...Перелетает Шелесту на другое плечо...>'
						,'\n\n<...Ловит блоху подмышкой...>'
						,'\n\n<...Ловит блоху...>'
						,'\n\n<...Ловко ловит блоху у хозяина за ухом...>'
						,'\n\n<...Щелкает клювом...>'
						,'\n\n<...Чешется...>'
						,'\n\n<...Сосредоточенно чистит перья...>'
						,'\n\n<...Пытается клюнуть хозяина в темечко...>'
						,'\n\n<...Пытается пересесть Шелесту на голову...>'
						,'\n\n<...Ловко сдергивает с хозяина парик...>'
						,'\n\n<...Ловко сдергивает с хозяина парик...>'
						,'\n\n<...Заговорщицки подмигивает...>'
						,'\n\n<...Хлопает крыльями...>'
						,'\n\n<...Расправляет крылья, гордо осматривается...>'
						,'\n\n<...Садится орлом...>'
						,'\n\n<...Садится орлом...\nКакает...>'
						,'\n\n<...Заботливо выщипывает волосы у Шелестa в ухе...>'
						,'\n\n<...Терeбит Шелестa за сережки...>'
						,'\nКрррасава!\n<...Натягивает хозяину стринги на уши...>'					
					],
					false // isDeletingComments
				).run();

	
