	
	let TrollBot = require('./classes/TrollBot');
	let Creds    = require('./config/creds/Kirill');
		
	new TrollBot(	Creds, 
					[//Good Guys
						'TIM'
						,'Al Gl'
						//,'Iuri Korhk'
						,'Путин Узурпатор'
						,'Николай Горбунов'
						,'Шкетإ'
						//,'Шкет!' // жeka
						,'УКРОП !'
						,'Khu Khu'
						,'Дискурсивный Феномен'
						,'Ясен Перец'
						,'Артем Артем'
						,'arie !'
						,'Яков'
						,'Димон'
						,'Нормальный Ватник'
						,'Ya Bo'
						,'Алексей Брёхов'
						,'sergo'
						,'Ильдар'
						,6384312
						,732175
						,6373030
						,6373791
						,5299619
						,6375945
						,6318323
						,6404221
					], 
					[// Bad Guys
					  ,'Александр Машенков'
					  ,'Carter Mayers'
					  ,'Андрей Крохин'
					  //,'Шкет!' // жeka
					  ,'В В'
					  ,'Владимир Растегаев'
					  ,'Александр Р780'
					  ,"Семен Семенович"
					  ,"Krassava",
					  ,"Кекс"
					  ,"Дмитрий З"
					  ,"Хотабыч"
					  ,"Stas"
					  ,"Визит Визитов"
					  ,"Ледоруб"
					  ,"Мишка Сафронов"
					  ,"Saratov"
					  ,"Андрюха"
					  ,"FLEX"
					  ,"Красна девица"
					  ,"женяя женя"
					  ,"Alex Pupkin"
						
					  ,6385162,6384204,6344300,5303000,6271931,6382472,5757121,6269777,6105926,5165511,745300,6311999
					], 
					[//insults
						"Каззёл!!!",
						"Дуррак!!",						
						"Чмо!!",  
						"Дятел!!", 
						"Иплан!!",
						"Баран!!",
						"Крретин!!",
						"глист!!",
						"дуболом!!",
						"Сказочный Дeбил!!",
						"Петух Гамбургский!",
						"Пидр Ливанский!",
						"Чмо Болотное!!",
						"Пидр Усрийский!",
						" - Козёл Тимур!",
						"Баобаб!",
						"Р-редиска!!",						
						"Тупень!!", 
						//"Сказочный Тупи3день",
						"Вафлюбушь?",
						"Булки Р-раздвинь!!",
						//", как я тебя вчера отмудохал?\nПонравилось?",
						"Обдристанный Хомяк!!",
						"Ниже плинтуса!!",
					], 
					[//praises
						 "Так Дер-ржать!!"
						,"Точно!"
						,"Так оно и есть!"
						,"Прр-равильно Говор-ришь!!"
						,"Прр-равильно !!"
						,"Ррр-разумно !!"
						,"Рр-рационально!!"
						,"Гр-рамотно!!"
					],
					[//actions
						 '\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Чешется, ищет блох...>'
						,'\n\n<...Ищет блох у Кхе в голове...>'
						,'\n\n<...Выдергивает перышко из подмышки...>'
						,'\n\n<...Какает Кхе на пиджак...>'
						,'\n\n<...Какает Кхе на пиджак...>'
						,'\n\n<...Перелетает Кхе на другое плечо...>'
						,'\n\n<...Ловит блоху подмышкой...>'
						,'\n\n<...Ловит блоху...>'
						,'\n\n<...Ловко ловит блоху у Кхе за ухом...>'
						,'\n\n<...Щелкает клювом...>'
						,'\n\n<...Чешется...>'
						,'\n\n<...Сосредоточенно чистит перья...>'
						,'\n\n<...Пытается клюнуть Кхе в темечко...>'
						,'\n\n<...Пытается пересесть Кхе на голову...>'
						,'\n\n<...Заговорщицки подмигивает...>'
						,'\n\n<...Хлопает крыльями...>'
						,'\n\n<...Расправляет крылья, гордо осматривается...>'
						,'\n\n<...Садится орлом...>'
						,'\n\n<...Садится орлом...\nКакает...>'
						,'\n\n<...Заботливо выщипывает волосы у Кхе в ухе...>'
						,'\n\n<...Терeбит Кхе за серьгу...>'						
					],
					false // isDeletingComments
				).run();

	
